Revit 2027 API
ExporterIFCUtils.AddValueString Method
 Adds a string value to a built-in parameter.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void AddValueString(
	Element element,
	ElementId builtInParameter,
	string propertyValue
)
Public Shared Sub AddValueString (
	element As Element,
	builtInParameter As ElementId,
	propertyValue As String
)
public:
static void AddValueString(
	Element^ element,
	ElementId^ builtInParameter,
	String^ propertyValue
)
static member AddValueString :
        element : Element *
        builtInParameter : ElementId *
        propertyValue : string -> unit
Parameters
element Element
 The element.
builtInParameter ElementId
 The built-in parameter id.
propertyValue String
 The new value.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace